app/Http/Controllers/TeamController.php

select `teams`.*, `team_user`.`user_id` as `pivot_user_id`, `team_user`.`team_id` as `pivot_team_id`, `team_user`.`role` as `pivot_role`, `team_user`.`created_at` as `pivot_created_at`, `team_user`.`updated_at` as `pivot_updated_at` from `teams` inner join `team_user` on `teams`.`id` = `team_user`.`team_id` where `team_user`.`user_id` = 1
select `users`.*, `team_user`.`team_id` as `pivot_team_id`, `team_user`.`user_id` as `pivot_user_id`, `team_user`.`role` as `pivot_role`, `team_user`.`created_at` as `pivot_created_at`, `team_user`.`updated_at` as `pivot_updated_at` from `users` inner join `team_user` on `users`.`id` = `team_user`.`user_id` where `team_user`.`team_id` in (11)
---
    public function index(): View
    {
        $user = Auth::user();

        // $teams = Team::with(['users', 'owner'])->latest()->paginate();
        $teams = $user->teams()->with(['owner', 'users'])->get();